# 1. Напишите программу, которая запрашивает у пользователя его имя и возраст, а затем выводит на экран приветствие в
# формате: "Привет, [имя]! Тебе [возраст] лет."
# Используйте команду input для получения данных от пользователя и команду print для вывода приветствия.

name = input('Введите ваше имя: ')
age = input('Введите ваш возраст: ')
print(f'Привет, {name}! Тебе {age} лет.')


# 2. 1100110 = 2 + 2^2 + 2^5 + 2^6 = 2 + 4 + 32 + 64 = 102
# 3. 1111111
