# Создать Jupyter Notebook, в ячейке написать 1+1, выполнить ячейку. Убедиться, что кроме числа 2 не вывелось ни
# ошибок, ни предупреждений. Закрыть Jupyter Notebook.
sum_variable = 1 + 1
print(sum_variable)

# Вывести на экран названия предметов, которые у будут на этой неделе на курсе
print('Python Fundamentals', 'Linux', 'German', 'Databases', sep='\n')